//P2PVOD   连续播放
if(document.body.innerHTML=='ｲﾎﾊｴ﨔｡'){
	logout();
}

var setTime = setInterval(function(){   //设置为15分钟
	if(document.getElementById('ChangeTimer15')&&swfobject.getObjectById('P2PVod')){
		swfobject.getObjectById('P2PVod').Pause();
		document.getElementById('ChangeTimer15').click();
		console.log("已设置为:15分钟!");
		last_remains = 900;
		clearInterval(setTime);
	}
},1000);

console.log('任务列表中还剩下'+JSON.parse(localStorage.LessionList).length+'个课件');

var LessionLength = {"1690":"35.5","1691":"38.5","1692":"35.5","1693":"31.5","1694":"71.5","1695":"29.5","1696":"29.5","1697":"30.5","1698":"35.5","1699":"28.5","1700":"38.5","1701":"44.5","1702":"37.5","1703":"32.5","1704":"32.5","1705":"29.5","1706":"28.5","1707":"27.5","1708":"22.5","1709":"42.5","1710":"26.5","1711":"27.5","1712":"28.5","1713":"18.5","1714":"28.5","1715":"46.5","1716":"34.5","1717":"32.5","1718":"34.5","1719":"29.5","1720":"22.5","1721":"31.5","1722":"42.5","1723":"36.5","1724":"32.5","1725":"17.5","1726":"32.5","1727":"33.5","1728":"27.5","1729":"17.5","1730":"38.5","1731":"27.5","1732":"30.5","1733":"27.5","1734":"23.5","1735":"26.5","1736":"27.5","1737":"44.5","1738":"26.5","1739":"23.5","1740":"34.5","1741":"29.5","1742":"60.5","1743":"23.5","1744":"26.5","1745":"49.5","1746":"33.5","1747":"23.5","1748":"38.5","1749":"22.5","1750":"30.5","1751":"24.5","1763":"42.5","1764":"35.5","1765":"15.5","1766":"30.5","1767":"31.5","1768":"44.5","1769":"28.5","1809":"11.5","1810":"34.5","1811":"45.5","1812":"30.5","1813":"20.5","1814":"44.5","1815":"18.5","1816":"32.5","1817":"37.5","1818":"34.5","1819":"52.5","1820":"31.5","1821":"59.5","1822":"58.5","1823":"52.5","1824":"22.5","1825":"52.5","1826":"34.5","1827":"33.5","1828":"42.5","1829":"15.5","1838":"56.5","1839":"48.5","1840":"81.5","1841":"60.5","1842":"70.5","1843":"36.5","1844":"108.5","1845":"63.5","1846":"77.5","1847":"40.5","1848":"60.5","1849":"54.5","1850":"54.5","1851":"45.5","1852":"55.5","1853":"56.5","1854":"54.5","1855":"43.5","1856":"39.5","1857":"60.5","1858":"48.5","1859":"37.5","1860":"72.5","1861":"29.5","1862":"15.5","1863":"27.5","1864":"30.5","1865":"30.5","1866":"13.5","1966":"28.5","1967":"15.5","1968":"21.5","1969":"20.5","1970":"24.5","1971":"16.5","1972":"41.5","1973":"40.5","1974":"19.5","1975":"27.5","1976":"54.5","1977":"32.5","1978":"27.5","1979":"11.5","1980":"20.5","1981":"15.5","1982":"56.5","1983":"48.5","1984":"107.5","1985":"18.5","1986":"22.5","1987":"41.5","1988":"34.5","1989":"40.5","1990":"58.5","1991":"35.5","1992":"38.5","1993":"61.5","1994":"50.5","1995":"24.5","1996":"103.5","1997":"32.5","1998":"23.5","1999":"20.5","2000":"22.5","2001":"11.5","2002":"6.5","2003":"43.5","2004":"52.5","2005":"21.5","2006":"68.5","2007":"26.5","2008":"8.5","2009":"61.5","2010":"95.5","2011":"42.5","2012":"65.5","2013":"123.5","2014":"18.5","2015":"16.5","2016":"12.5","2017":"20.5","2018":"15.5","2019":"41.5","2020":"26.5","2021":"21.5","2022":"45.5","2023":"26.5","2024":"10.5","2025":"22.5","2026":"36.5","2027":"20.5","2028":"81.5","2029":"25.5","2030":"17.5","2031":"29.5","2032":"17.5","2033":"16.5","2034":"57.5","2035":"26.5","2036":"23.5","2037":"27.5","2038":"27.5","2039":"23.5","2040":"28.5","2041":"21.5","2042":"34.5","2043":"66.5","2044":"32.5","2045":"15.5","2046":"29.5","2047":"25.5","2048":"33.5","2049":"38.5","2050":"41.5","2051":"30.5","2052":"45.5","2053":"41.5","2054":"44.5","2055":"24.5","2056":"42.5","2057":"47.5","2058":"44.5","2059":"40.5","2060":"46.5","2061":"60.5","2062":"35.5","2063":"29.5","2064":"40.5","2065":"36.5"};

var currentLength = LessionLength[getID()]*60;  //当前视频的长度

function run(){
	if(typeof(minutes)=='undefined'||typeof(seconds)=='undefined'){
		swfobject.getObjectById('P2PVod').Pause();
	}
	
	if(document.getElementById("string").innerHTML=='此课件观看时长已满足！'){
		var LessionList = JSON.parse(localStorage.LessionList);
		if(LessionList&&LessionList.length>0){
			var url = LessionList.shift();
			console.log('本视频已看完,5分钟后将播放的视频地址是:\n'+url);
			console.log('剩余视频个数为:'+LessionList.length);			
			localStorage.LessionList = JSON.stringify(LessionList);
			setTimeout(function(){
					window.location=url;
			},300000);	
			clearInterval(auto_play);//停止轮询
		}else{
			alert('任务列表中已没有视频!');
			window.close();
		}
		return;
	}

	if(minutes==0&&seconds==0&&document.getElementById('RecordBut').disabled==false){
		var minus = parseInt(currentLength) - (parseInt(document.getElementById("RecordTime").innerHTML)+nsTimer)*60;
		document.getElementById('RecordBut').click();
		document.getElementById('RecordBut').disabled = 'true';
		if(minus<=180){
			document.getElementById('ChangeTimer1').click();	
		}else if(minus<=500){
			document.getElementById('ChangeTimer5').click();
		}else if(minus<=750){
			document.getElementById('ChangeTimer10').click(); 	
		}else{
			document.getElementById('ChangeTimer15').click(); 	
		}
	}
}

function list(){  //列出当前任务列表
	var LessionList = JSON.parse(localStorage.LessionList);
	console.log('任务列表中共有'+LessionList.length+'个视频！');
	for (var i = 0; i < LessionList.length; i++) {
		console.log('第'+i+'个视频：');
		console.log(LessionList[i]);
	};
}

function logout(){
	$.ajax({
        type: "POST",
        url: "/Ajax/Ajax.do?action=Logout",
        success: function(data) {
        	window.location.href = 'http://www.lt-edu.net/User/';
        },
        error:function(){
        	alert('请重新登陆,插件才会正常工作!');
        }
    });
}

//获取当前课件ID
function getID(){
	var reg=/ID=\d+/;
	var id = reg.exec(window.location.href); 
	id = id[0].substr(id[0].indexOf('=')+1);
	return id;
}

auto_play = setInterval('run()',30000);