//一、1
document.getElementsByName('Ans366')[0].value=
'幼儿发展评价是幼儿教育工作者因人施教的前提和重要依据，也是检测幼儿教育课程或方案的效果的重要手段。幼儿发展评价是否科学、恰当，主要决定于幼儿发展评价方案是否科学。因此，对幼儿的发展进行评价前，要选择科学、有效而又切实可行的评价方案，有条件的地方可以组织力量根据当地的实际情况编制此类评价工具。';
//一、2
document.getElementsByName('Ans367')[0].value=
'观察法是幼儿园教育评价中最基本的方法，是评价者在自然条件下对评价对象进行有目的、有计划的直接感知、记录，继而分析、解释这些现象和事实发生的原因或发展趋势，从而获得结论的一种评价方法.';
//一、3
document.getElementsByName('Ans368')[0].value=
'发展泛指事物由简单到复杂、由低级到高级逐渐展开和运动的过程。';
//一、4
document.getElementsByName('Ans369')[0].value=
'教师自制测验指在评价中教师为了了解本班幼儿在某一方面的发展情况自制测验项目，对评价对象进行测试，它是教师了解幼儿的好帮手。';
//二、1
document.getElementsByName('Ans370')[0].value=
'答：教师在教学中进行儿童发展评价的原因：第一，幼儿评价以幼儿的情感 、态度和能力为评价价值 取向，强调幼儿在情感、态度和能力而非知识经验方面的发展；  第二，从语言、社会、科学、艺术、健康五个人领域进行评价，或者从八项智能：运动智能、语言智能、自我认识智能、人际交往智能、数理逻辑智能、自然观察者智能、空间智能、音乐智能。  第三，从评价的方法来看，强调过程性评价和终结性评价相结合，定性评价和定量评价相结，幼儿发展各领域评价相结合，幼儿发展各阶段评价相结合等 。';