//一、1
document.getElementsByName('Ans750')[0].value='道德';
//一、2
document.getElementsByName('Ans751')[0].value='学习终身化';
document.getElementsByName('Ans751')[1].value='成长自信化';
//一、3
document.getElementsByName('Ans752')[0].value='沟通';

//二、1
document.getElementById('Ans33').click();
//二、2
document.getElementById('Ans41').click();

//三、1
document.getElementById('Ans50').click();
//三、2
document.getElementById('Ans61').click();
//三、3
document.getElementById('Ans70').click();

//四、1
document.getElementsByName('Ans758')[0].value=
'（一）幼儿园的应对策略：与家长一起分享孩子成长的喜悦 当家长把更多的注意力放在弟弟妹妹身上时，其实家长心里肯定也是有愧疚感的。因此，教师千万不能跟家长说“请您也多关注一下这个孩子”之类的话，避免将家长逼迫到更窘迫的境地。如果家长的心境没有了空间，自然就无法与孩子真诚面对。因此，我们教师应该尽量在日常活动中对家长在育儿时的辛苦表示同感，在倾听家长抱怨的同时，想办法尽量让家长的心情轻松起来。在此基础上，再想办法让家长更多地关注孩子。其实，不管存在何种障碍，孩子总是会不断成长的。随着孩子的不断成长，我们也会明显感受到“孩子现在会做这个也会做那个了”。特别是轻度发育障碍儿童在交流方面表现出的成长，对家长来说是最值得欣慰的。\n'+
'心理咨询师的观点：面向兄弟的支援系统是一个重要课题 美国有不少适合家长与孩子们一起阅读的专业书籍和绘本，还有这方面的专业心理咨询服务。但是目前国内在这一方面仍然比较落后。今后，针对兄弟的专业支援系统将成为这一领域的重要课题之一。 \n'+'当兄弟姐妹中的某一方存在发育障碍时，可能会引发以下问题。 \n'+
	'1．如上述案例中那样，家长将全部感情倾注在没有障碍的那个孩子身上，使有障碍的孩子处于被忽视状态。 \n'+
	'2．家长完全将精力放在存在障碍的那个孩子身上，使另一个孩子感觉被家长抛弃，从而产生失落感，甚至采取反抗态度。 \n'+
	'3．因为自己有个发育障碍的兄弟而被其他孩子欺负，导致孩子胆小而郁郁寡欢。 对于1的情况，建议家长接受一些心理咨询。\n'+
	'对于2、3的情况，可以根据两兄弟的年龄，选择一些介绍障碍相关内容的、符合孩子阅读习惯的书籍，家长与孩子一起阅读，让孩子对自己兄弟的障碍问题有所了解。 有些家长因为目前还比较年轻，往往会将所有精力投入到应付眼前的困难上去，很少去认真考虑将来的各种情况。但假如某天父母离世了，照顾障碍一方的责任就完全落到了他的兄弟身上。考虑到这一点，让兄弟之间从小建立起良好的关系是非常重要的。';
//四、2
document.getElementsByName('Ans759')[0].value=
'1.平等对待，关注每一个幼儿;\n'+
'2.平等对待，得将心比心;\n'+
'3.注重个别教育。\n'+
'人都是感性的，经常是说得容易做得难。但是我相信，只要我们用真心对待每一个幼儿，遇到事情能够多思考，多一份理解与宽容，这样“偏爱”和“不公平”的现象也就会渐渐减少甚至是不会发生，每一个幼儿也能够快乐、全面的成长。';