//一、1
document.getElementsByName('Ans1202')[0].value=
'建设班集体是班主任的首要任务。那么，作为班主任建设班集体应该：\n'+
'（1）确立共同目标，激发上进愿望；\n'+
'（2）强化集体观念，维护班级荣誉；\n'+
'（3）建立组织机构，明确服务意识；\n'+
'（4）制定班级规范，实施自主管理；\n'+
'（5）尊重学生差异，促进个性发展。';

//一、2
document.getElementsByName('Ans1203')[0].value=
'幼儿园班级可以说是有各种班级活动共同组成，那么开展班级活动的教育价值在于：\n'+
'（1）有利于学生的个人成长；\n'+
'（2）有利于班级良好人际关系的建立；\n'+
'（3）有利于班集体的形成。';


//一、3
document.getElementsByName('Ans1204')[0].value=
'班主任应该设计与组织一次优秀的班级活动应：\n'+
  '（1）从班级特点和学生的需要出发，设计活动主题；\n'+
  '（2）发动全体同学参与班级活动；\n'+
  '（3）记录活动过程，再现活动情境。';