//一、1
document.getElementsByName('Ans1210')[0].value=
'混龄班出现的原因有：\n'+
'（1）受经济发展水平影响；\n'+
'（2）受生源影响；\n'+
'（3）受国家政策及家庭情况影响。\n'+
'\n'+
 '优势：（1）差异互补；\n'+
 '　　　（2）培养人格；\n'+
 '　　　（3）发挥潜能。\n'+
'\n'+
 '不足：（1）课程设计与实施难度较大，相应教师难求；\n'+
 '　 　 （2）容易造成教育时间上的浪费；\n'+
 '      （3）容易造成顾此失彼，影响幼儿发展。';

//一、2
document.getElementsByName('Ans1211')[0].value=
'班主任建设班级文化的方式方法：\n'+
'（1）优化班级环境；\n'+
'（2）强化学生的主体作用；\n'+
'（3）发挥激励作用。';

//一、3
document.getElementsByName('Ans1212')[0].value=
'班主任创建有利于学生发展的班级文化环境包括：\n'+
'（1）班级有“花香”；\n'+
'（2）班级有“书香”；\n'+
'（3）班级有“心语”。';